Revit 2027 API
FabricationRodInfo.GetRodLength Method
 Get the current rod length. If the rod is the length will include structural extension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetRodLength(
	int rodIndex
)
Public Function GetRodLength (
	rodIndex As Integer
) As Double
public:
double GetRodLength(
	int rodIndex
)
member GetRodLength :
        rodIndex : int -> float
Parameters
rodIndex Int32
 The rod index.
Return Value
Double
 Returns rod length of hanger for specified end.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace